/***************************************************************************
实验名称： 模拟电压测量实验(并行)

实验模块:  51单片机核心板、液晶显示区（12864）、并行AD转换区

实验接线：	51单片机核心板------并行AD转换区
					 P3.0--------------START
					 P3.1--------------EOC
					 P3.2--------------OE
					 P3.3--------------CLKX2
				P1.0~P1.7--------------D0~D7		

			51单片机核心板------液晶显示区（12864字符液晶）
					 P2.0--------------CS1
					 P2.1--------------CS2
					 P2.2--------------CS
					 P2.3--------------RW
					 P2.4--------------E
				P0.0~P0.7--------------DB0~DB7		
						
现象描述：	12864显示电压值

更新时间：	2017.10.18
***************************************************************************/



#include <reg52.H>
#include <12864.c>
sbit START = P3^0;
sbit EOC = P3^1;
sbit OE  = P3^2;
sbit CLK = P3^3;
unsigned char getdata;

/************************************************/
//定时器初始化
void init()
{

	LCD12864_Init();
	LCD12864_Clear();
	Display();
    TMOD= 0x03;// 定时器0工作方式3
    TH0 = 0xff;// 定时器0赋初值
    TL0 = 0x00;
    TR0 = 1;
    ET0 = 1;
    EA  = 1;

}

/***********************************************/
//软件延时产生ADC0809的时钟
void clk() interrupt 1
{ 
        CLK=(~CLK);
}


/************************************************/
//AD转换函数
unsigned char ADC()
    {
         char value;
		 START=0; 
		 START=1;      //开始转换命令
		 START=0;
		 while(EOC==0);//等待转换结束
		 OE=1;
		 value=P1;
		 OE=0;
         return value;
     }


/************************************************/
void main()
{
	float v=0;
    init();
    START = 1;       // ST端产生正脉冲
    START = 0;
    while(1)
        {
            v=ADC();//输出转换得到的数据
			v=v/255;
			display(v);
        }
}
