/***************************************************************************
实验名称： 简易IO扩展输入实验

实验模块:  51单片机核心板、拨码开关区、LED显示区、简易IO扩展区

实验接线： 51单片机核心板------简易IO扩展区
				P1.0------------nOE
				P1.1------------T/nR
				P2	------------ J45
		   51单片机核心板------拨码开关区
				P0	------------ J1
		   简易IO扩展区	------ 	LED显示区
				J44	------------ J4
现象描述：通过扩展IO读取的开关数据，在LED上显示出来

更新时间：2017.10.17
***************************************************************************/
#include <reg52.h> 
sbit OE = P1^0;//245输出允许
sbit TR = P1^1;//发送、接收设置；
void main()
{
	 unsigned char a = 0;
	 OE = 0; 		//输出允许
	 TR = 0; 		//此处设为A输出，B输入
	 while(1)
	 {
		  P0 = 0xff; 	//P0置为输入
		  a = P0;		//读取P0的值
		  P2 = a; 		//值赋给P2 
	 }
}