/***************************************************************************
ÊµÑéÃû³Æ£º ¼òÒ×IOÀ©Õ¹Êä³öÊÊµÑé

ÊµÑéÄ£¿é:  51µ¥Æ¬»úºËÐÄ°å¡¢LEDÏÔÊ¾Çø¡¢¼òÒ×I/OÀ©Õ¹Çø

ÊµÑé½ÓÏß£º 51µ¥Æ¬»úºËÐÄ°å------¼òÒ×I/OÀ©Õ¹Çø
					P1.0---------nOE					
					P1.1---------T/nR
			   P0.0~P0.7---------A0~A7
			   
			¼òÒ×I/OÀ©Õ¹Çø------LEDÏÔÊ¾Çø
				  B0~B7---------LED1~LED8	
						
ÏÖÏóÃèÊö£ºLEDÊä³ö01010101Êý¾Ý

¸üÐÂÊ±¼ä£º2017.10.17
***************************************************************************/


#include <reg52.h> 
sbit OE = P1^0;	//245Êä³öÔÊÐí
sbit TR = P1^1;	//·¢ËÍ¡¢½ÓÊÕÉèÖÃ
void main()
{
 OE = 0; 		//Êä³öÔÊÐí
 TR = 1; 		//ÖÃÎªAÊäÈë£¬BÊä³ö
 P0 = 0x55;
 while(1);
}
