/***************************************************************************
实验名称： 外部中断实验

实验模块:  51单片机核心板、发光管、拨码开关、轻触开关区

实验接线： 51单片机核心板------发光管、拨码开关、轻触开关区

						P1---------J4	
						
						P3.2---------K1
						
现象描述：按动一下K1，LED按照二进制加的方式熄灭

更新时间：2017.10.17
***************************************************************************/


#include<reg52.h>	//添加库文件
#include<stdio.h>	
#define uint unsigned int
uint a = 0xFF;

void main(void)
{	

	IE = 0x81;		//启动外部中断0
	IT0 = 1;		//外部中断0，脉冲触发方式，下降沿触发有效
	while(1);
}

void INIT_0(void) interrupt 2
{
	a += 1;		
	P1 = a;          //P1加1

}




