/***************************************************************************
实验名称： 日历时钟实验

实验模块:  51单片机核心板、时钟日历区、液晶显示区

实验接线： 51单片机核心板------时钟日历区
					P1.0---------SDA
					P1.1---------SCL					
			51单片机核心板------液晶显示区（1602字符液晶）
					P2.0---------RS
					P2.1---------RW
					P2.2---------E
			   P0.0~P0.7---------BD0~BD7
					
现象描述：单片机从PCF8563读取的时间数据在1602上显示

更新时间：2017.10.17
***************************************************************************/

#include <STC8A.h>	//添加库文件
#include <1602.h>	//添加自定义的库文件，自定义库文件在文件夹内
#include <I2C.h>
#include <PCF8563.h>
			//各种IO和操作的定义见相关头文件。
uchar SystemError;

void Init()
{
	P0M1 = 0x00;
	P0M0 = 0xff;
	
	P1M1 = 0x00;
	P1M0 = 0xff;
	
	P2M1 = 0x00;
	P2M0 = 0xff;
}
void main(void)
{    
	 Init();
     LCMInit(); 	//LCM初始化
     P1=0xff;
     SetPCF8563(0x02,0x11);
     SetPCF8563(0x03,0x01);
     SetPCF8563(0x04,0x01);
     SetPCF8563(0x05,0x01);
     SetPCF8563(0x07,0x01);
     SetPCF8563(0x08,0x09);
     while(1)
	{  
		time_display(0,0);
    }						 
}
