/***************************************************************************
实验名称： IO读写实验

实验模块:  51单片机核心板、发光管、拨码开关、轻触开关区

实验接线： 51单片机核心板------发光管、拨码开关、轻触开关区

						P0---------J1
						P1---------J4
						
现象描述：拨动开关SW1~SW8，对应的LED亮灭

更新时间：2017.10.18
***************************************************************************/


#include"reg52.h"		//添加库文件
#define uchar unsigned char	
#define uint unsigned int


void mDelay(uint Delay)	//延时
{	uint i;
	for(;Delay > 0;Delay--)
		for(i = 0;i < 110;i++);
}

void main()
{
	while(1)
	{
		P1 = P0;			 //把P0输入到P1
		mDelay(1000);		//调用延时程序，延时1000毫秒
	}
}

