/***************************************************************************
实验名称： 串行AD转换实验

实验模块:  51单片机核心板、LED示区、串行A/D转换区

实验接线：  51单片机核心板------串A/D转换区
					 P2.0 --------- CLK
					 P2.1 ---------	SDA  
					 P2.2 --------- CS
										 
			51单片机核心板------LED示区
					 P0  ---------  J4	
						
现象描述：	转换结果直接以二进制形式在LED上显示。可调节电位器R31改变输入的模拟量

更新时间：  2017.10.17
***************************************************************************/

#include<reg52.h>
sbit CLK = P2^0;  //时钟端口
sbit SDA = P2^1;  //数据端口
sbit CS  = P2^2;  //片选端口

//******************************************************
//延时子程序
void delay(unsigned int x)
{
	unsigned int y=x;
	do{y--;}
    while(y>1);
}

//******************************************************
//读取转换数值
unsigned int read()
{
 	unsigned int i=0,value=0;
	delay(2);
	for(i=0;i<8;i++)
	{
		CLK=1;	         //产生上升沿
		value=value<<1;  //数据左移一位
		if(SDA==1)
        value=value+1;  //读取数值
		CLK=0;
	}
	return value;        //返回数据
}

//******************************************************
void main()
{
	unsigned int data2=0;
	CLK=0;             	//初始化时钟端口
	CS=1;        		//片选	
	while(1)
	   {
			CS=1;        	//片选
			delay(100);    	//等待转换
			CS=0;
			data2=read();	//读取转换数据	
			P0=~data2;      //P0口显示转换数据
      }
}