/***************************************************************************
ÊµÑéÃû³Æ£º Íâ²¿ÖĞ¶ÏÊµÑé

ÊµÑéÄ£¿é:  51µ¥Æ¬»úºËĞÄ°å¡¢·¢¹â¹Ü¡¢²¦Âë¿ª¹Ø¡¢Çá´¥¿ª¹ØÇø

ÊµÑé½ÓÏß£º 51µ¥Æ¬»úºËĞÄ°å------·¢¹â¹Ü¡¢²¦Âë¿ª¹Ø¡¢Çá´¥¿ª¹ØÇø

						P1---------J4	
						
						P3.2---------K1
						
ÏÖÏóÃèÊö£º°´¶¯Ò»ÏÂK1£¬LED°´ÕÕ¶ş½øÖÆ¼ÓµÄ·½Ê½Ï¨Ãğ

¸üĞÂÊ±¼ä£º2017.10.17
***************************************************************************/


#include<reg52.h>	//Ìí¼Ó¿âÎÄ¼ş
#define uint unsigned int

void delay(int t){
	while(t--){
	unsigned char data i, j;
	i = 11;
	j = 190;
	do
	{
		while (--j);
	} while (--i);
	}
}

void light_flout(){
	int i;
	for(i=0;i<8;i++){
		P1=(0x01<<i);
		delay(50);
	}
	for(i=7;i>-1;i--){
		P1=(0x01<<i);
		delay(50);
	}
}

void main(void)
{	
	IE=0x85;
	PX1=1;
	IT0 = 1;		//Íâ²¿ÖĞ¶Ï0£¬Âö³å´¥·¢·½Ê½£¬ÏÂ½µÑØ´¥·¢ÓĞĞ
	IT1 = 1;
	while(1){
				light_flout();
	}
}

void INIT_0(void) interrupt 0
{
	int i=0;
	P1=0xFF;
	for(i=0;i<3;i++){
	P1=0x00;
	delay(50);
	P1=0xFF;
	delay(50);
	}
}

void INIT_1(void) interrupt 2
{
	int i=0;
	for(i=0;i<3;i++){
	P1=0x0F;
	delay(50);
	P1=0xF0;
	delay(50);
	}
}




